In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/test

Values are hard coded here (i.e):

In [11]:
%%sql
select
case
    when 35>18 then 'true'
    when 35<18 then 'false'
else 'Invalid input'
end as test

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[('true',)]

In [4]:
%%sql
create database if not exists tutorial;
use tutorial;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.
0 rows affected.

[]

In [4]:
%%sql
drop table if exists customer_data;
create table customer_data(
    id INT PRIMARY KEY ,
    customer_name VARCHAR(100) NOT NULL,
    email VARCHAR(100),
    phone_number VARCHAR(100),
    address VARCHAR(100),
    amount DECIMAL(10,2)
);

INSERT INTO customer_data (id, customer_name, email, phone_number, address, amount)
VALUES
(1, 'Ravi', 'ravi@example.com', '9876543210', 'Chennai', 5000.00),
(2, 'Priya', NULL, '9876543211', 'Bangalore', NULL),
(3, 'Arjun', 'arjun@example.com', NULL, 'Hyderabad', 1500.00),
(4, 'Meena', NULL, NULL, 'Mumbai', 2500.00),
(5, 'Karthik', 'karthik@example.com', '9876543212', NULL, 3000.00);
select * from customer_data

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.
5 rows affected.
5 rows affected.

[(1, 'Ravi', 'ravi@example.com', '9876543210', 'Chennai', Decimal('5000.00')),
 (2, 'Priya', None, '9876543211', 'Bangalore', None),
 (3, 'Arjun', 'arjun@example.com', None, 'Hyderabad', Decimal('1500.00')),
 (4, 'Meena', None, None, 'Mumbai', Decimal('2500.00')),
 (5, 'Karthik', 'karthik@example.com', '9876543212', None, Decimal('3000.00'))]

In [11]:
%%sql
select customer_name,
amount,
case
    when amount > 4000 then 'High Spender'
when amount between 2000 and 4000 then 'Medium Spender'
when amount <= 2000 then 'Low spender'
else 'No data'
end as spending
from customer_data

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[('Ravi', Decimal('5000.00'), 'High Spender'),
 ('Priya', None, 'No data'),
 ('Arjun', Decimal('1500.00'), 'Low spender'),
 ('Meena', Decimal('2500.00'), 'Medium Spender'),
 ('Karthik', Decimal('3000.00'), 'Medium Spender')]

In [14]:
%%sql
select customer_name,
case
    when phone_number is null then email
end as Contact
from customer_data

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[('Ravi', None),
 ('Priya', None),
 ('Arjun', 'arjun@example.com'),
 ('Meena', None),
 ('Karthik', None)]

In [15]:
%%sql
select customer_name,
case
    when phone_number is null then email
else  phone_number
end as Contact
from customer_data

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[('Ravi', '9876543210'),
 ('Priya', '9876543211'),
 ('Arjun', 'arjun@example.com'),
 ('Meena', None),
 ('Karthik', '9876543212')]

Ordering of conditions can affect the output

In [12]:
%%sql
select customer_name,
case
when phone_number is null and email is null then '999'
    when phone_number is null then email

else  phone_number
end as Contact
from customer_data

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[('Ravi', '9876543210'),
 ('Priya', '9876543211'),
 ('Arjun', 'arjun@example.com'),
 ('Meena', '999'),
 ('Karthik', '9876543212')]

Use limit in Real-Time for cost efficiency (for read and write)

In [17]:
%%sql
select * from customer_data limit 2;

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[(1, 'Ravi', 'ravi@example.com', '9876543210', 'Chennai', Decimal('5000.00')),
 (2, 'Priya', None, '9876543211', 'Bangalore', None)]

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql